Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/Trad_Ita-level2.tmx
Source language: en_us
Languages: it_it

source: They are all placed in the project's main ("root") folder, and have the names <project name>-level1.tmx, <project name>-level2.tmx and <project name>-omegat.tmx.
it_it: Sono tutti posizionati nella cartella principale ("root") del progetto e hanno i nomi <nome progetto>-level1.tmx, <nome progetto>-level2.tmx e <nome progetto>-omegat.tmx.

source: They are deposited in the project's root folder, and what you then do with them is left to you.
it_it: Vengono depositate nella cartella principale del progetto e ciò che poi si può fare con loro è lasciato a all'utente.

source: This command is executed each time you create the translated documents, and it also produces the output translation memories at the same time.
it_it: Questo comando viene eseguito ogni volta che si creano i documenti tradotti e contemporaneamente produce anche le memorie di traduzione di output.

source: This file contains only the segments that have been translated in the project up to now.
it_it: Questo file contiene solo i segmenti che sono stati tradotti nel progetto finora.

source: This is the case for example when a source file is changed mid-project (perhaps because your customer sent you an edited version before you had completed the translation, or because you edited it yourself, for example to remove an unwanted line break).
it_it: Questo è il caso, ad esempio, quando un file sorgente viene modificato nel corso del progetto (magari perché il cliente ha inviato una versione modificata prima che si completasse la traduzione, o perché è stato modificato in proprio, ad esempio per rimuovere un'interruzione di riga indesiderata).

source: This marking of all segments from past jobs as "orphan segments" has a further drawback compared to the per-job project method.
it_it: Questo contrassegno di tutti i segmenti dei lavori passati come "segmenti orfani" presenta un ulteriore inconveniente rispetto al metodo del progetto per singolo lavoro.

source: This may give you a false sense of security about their reliability.
it_it: Ciò potrebbe dare un falso senso di sicurezza sulla loro affidabilità.

source: This method is quite different: instead of creating a new project for each job, you "recycle" an existing project.
it_it: Questo metodo è abbastanza diverso: invece di creare un nuovo progetto per ogni lavoro, si "ricicla" un progetto esistente.

source: This requires some discipline on your part: whenever you finish a job, you must copy one of the three output translation memories into the relevant repository.
it_it: Ciò richiede una certa disciplina: ogni volta che si finisce un lavoro, si deve copiare una delle tre memorie di traduzione di output nel relativo repository.

source: Three output translation memory files are created when you hit Ctrl-d.
it_it: Quando si preme Ctrl-d vengono creati tre file di memoria di traduzione di output.

source: To do this, you remove the source files from the last job from the \source\ folder, and replace them with the source files for the current job.
it_it: Per fare ciò, si rimuovono i file di origine dell'ultimo lavoro dalla cartella \source\ e si sostituiscono con i file di origine del lavoro corrente.

source: Two methods, both popular, are described below.
it_it: Di seguito vengono descritti due metodi, entrambi popolari.

source: Understanding this concept is crucial if you aim to use OmegaT effectively.
it_it: Comprendere questo concetto è fondamentale per utilizzare OmegaT in modo efficace.

source: Variants of the per-job and recycled project methods
it_it: Varianti dei metodi per-job e progetto riciclato

source: Viewing the content of translation memories in an OmegaT project
it_it: Visualizzare il contenuto delle memorie di traduzione in un progetto OmegaT

source: When you run the first of the scripts from within OmegaT with Tools > Scripting, the second script presents you with a "Save As" menu with which you can save the output TM to the location and with the name of your choice.
it_it: Quando si esegue il primo degli script da OmegaT con Strumenti > Scripting, il secondo script presenta un menu "Salva con nome" con il quale è possibile salvare la TM di output nella posizione e con il nome di propria scelta.

source: With a little more effort, you can refine this process.
it_it: Con un piccolo sforzo in più, si può perfezionare questo processo.

source: You can also use the external post-processing command on individual projects.
it_it: Si può anche utilizzare il comando di post-elaborazione esterno su singoli progetti.

source: You can define a pattern for your project names and configure the script to save the output TM to a particular repository folder based on the project's name.
it_it: È possibile definire un pattern per i nomi dei progetti e configurare lo script per salvare la TM di output in una particolare cartella del repository in base al nome del progetto.

source: You can use this output TM as an input TM in future projects.
it_it: Si può utilizzare questa TM di output come TM di input in progetti futuri.

source: You may however want to limit the number (in the interests of speed), and select them carefully, in order to have more relevant matches displayed to you.
it_it: Tuttavia, si potrebbe voler limitare il numero (nell'interesse della velocità) e selezionarli attentamente, in modo da visualizzare corrispondenze più pertinenti.

source: You may not be able to program, but this should not put you off exploiting these very powerful functions of OmegaT.
it_it: Pur non essendo in grado di programmare, non ci si dovrebbe scoraggiare dallo sfruttare queste potentissime funzioni di OmegaT.

source: or
it_it: oppure
